# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'flutter'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
#brew 'php'
#brew 'imagick'
#brew 'mysql'
brew 'java'
brew 'node'
brew 'redis'

brew 'usbmuxd'
brew 'ios-deploy'
brew 'ideviceinstaller'
brew 'cocoapods'


# Apps
# cask 'atom'
cask 'android-studio'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
#cask 'java'
#cask 'now'
cask 'phpstorm'
#cask 'quip'
cask 'sequel-pro'
# cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'spotify'
# cask 'tower2'
cask 'transmission'
cask 'unity'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Xcode', id: 497799835
#mas 'Giphy Capture', id: 668208984
#mas 'Spark', id: 1176895641
#mas 'The Unarchiver', id: 425424353
#mas 'Tweetbot', id: 1384080005
#mas 'WhatsApp', id: 1147396723 
